{"_id":6,"Title":"Matilda","Description":"The plot centers on the titular child prodigy who develops psychokinetic abilities and uses them to deal with her disreputable family and the tyrannical principal of her school.","Genre":{"Name":"Comedy","Description":"A comedy film is a category of film which emphasizes humor. These films are designed to make the audience laugh through amusement."},"Director":{"Name":"Danny DeVito","Bio":"Daniel Michael DeVito Jr. is an American actor, comedian, and filmmaker. He gained prominence for his portrayal of the taxi dispatcher Louie De Palma in the television series Taxi, which won him a Golden Globe Award and an Emmy Award.","Birth":"1944"},"ImagePath":"Matilda.png","Featured":false}
{"_id":7,"Title":"Babe","Description":"Arthur Hoggett, a gentle farmer, wins a piglet named Babe at a county fair. Narrowly escaping his fate as Christmas dinner when Farmer Hoggett decides to show him at the next fair.","Genre":{"Name":"Comedy","Description":"A comedy film is a category of film which emphasizes humor. These films are designed to make the audience laugh through amusement."},"Director":{"Name":"George Miller","Bio":"George Miller AO is an Australian filmmaker best known for his Mad Max franchise, whose second installment, Mad Max 2, and fourth, Fury Road, have been hailed as two of the greatest action films of all time, with Fury Road winning six Academy Awards.","Birth":"1945"},"ImagePath":"babe.png","Featured":false}
{"_id":8,"Title":"Princess Diaries 1","Description":"The film follows Mia Thermopolis, a shy American teenager who learns she is heir to the throne of a European kingdom. Under the tutelage of her estranged grandmother, the kingdom''s reigning queen, Mia must decide whether to claim the throne she has inherited or renounce her title permanently.","Genre":{"Name":"Comedy","Description":"A comedy film is a category of film which emphasizes humor. These films are designed to make the audience laugh through amusement."},"Director":{"Name":"Garry Marshall","Bio":"Garry Kent Marshall was an American filmmaker and actor. He started his career in the 1960s writing for The Lucy Show and The Dick Van Dyke Show before he developed Neil Simon's 1965 play The Odd Couple for television in 1970.","Birth":"1934"},"ImagePath":"Princess_Diaries_One.png","Featured":false}
{"_id":9,"Title":"High School Musical 1","Description":"A popular high school athlete and an academically gifted girl get roles in the school musical and develop a friendship that threatens East High''s social order","Genre":{"Name":"Musical","Description":"Musical film is a film genre in which songs by the characters are interwoven into the narrative, sometimes accompanied by dancing."},"Director":{"Name":"Kenny Ortega","Bio":"Kenneth John Ortega is an American filmmaker, touring manager, and choreographer. He is known for directing the films Newsies, Hocus Pocus, The Cheetah Girls 2, High School Musical, Michael Jackson's This Is It, Descendants, and Julie and the Phantoms.","Birth":"1950"},"ImagePath":"Highschool_musical_1.png","Featured":false}
{"_id":10,"Title":"Cars 1","Description":"On the way to the biggest race of his life, a hotshot rookie race car gets stranded in a rundown town, and learns that winning isn't everything in life","Genre":{"Name":"Animated","Description":"Animation is a method in which pictures are manipulated to appear as moving images. In traditional animation, images are drawn or painted by hand on transparent celluloid sheets to be photographed and exhibited on film."},"Director":{"Name":"John Lasseter","Bio":"John Alan Lasseter is an American film director, producer, screenwriter, animator, voice actor, and the head of animation at Skydance Animation. He was previously the chief creative officer of Pixar Animation Studios, Walt Disney Animation Studios, and Disneytoon Studios, as well as the Principal Creative Advisor for Walt Disney Imagineering.","Birth":"1957"},"ImagePath":"cars_1.png","Featured":false}
{"_id":11,"Title":"Cars 2","Description":"Race star Lightning McQueen is invited to the World Grand Prix, a race inviting all of the best race cars from around the world. But suddenly, things get turned upside down when Mater gets mistaken for an American spy. And a pair of bad guys called The Lemons are sabotaging the race with an evil camera.","Genre":{"Name":"Animated","Description":"Animation is a method in which pictures are manipulated to appear as moving images"},"Director":{"Name":"John Lasseter","Bio":"John Alan Lasseter is an American film director, producer, screenwriter, animator, voice actor, and the head of animation at Skydance Animation. He was previously the chief creative officer of Pixar Animation Studios, Walt Disney Animation Studios, and Disneytoon Studios, as well as the Principal Creative Advisor for Walt Disney Imagineering.","Birth":"1957"},"ImagePath":"cars_2.png","Featured":false}
{"_id":2,"Title":"Finding Nemo","Description":"It tells the story of an overprotective clownfish named Marlin who, along with a regal blue tang named Dory, searches for his missing son Nemo. Along the way, Marlin learns to take risks and comes to terms with Nemo taking care of himself.","Genre":{"Name":"Animated","Description":"Animation is a method in which pictures are manipulated to appear as moving images."},"Director":{"Name":"Andrew Stanton","Bio":"Andrew Ayers Stanton is an American filmmaker and voice actor based at Pixar, which he joined in 1990.","Birth":"1965"},"ImagePath":"Finding_Nemo.png","Featured":true}
{"_id":3,"Title":"Finding Dory","Description":"Dory is a wide-eyed, blue tang fish who suffers from memory loss every 10 seconds or so. The one thing she can remember is that she somehow became separated from her parents as a child. With help from her friends Nemo and Marlin, Dory embarks on an epic adventure to find them.","Genre":{"Name":"Animated","Description":"Animation is a method in which pictures are manipulated to appear as moving images."},"Director":{"Name":"Andrew Stanton","Bio":"Andrew Ayers Stanton is an American filmmaker and voice actor based at Pixar, which he joined in 1990.","Birth":"1965"},"ImagePath":"Finding_Dory.png","Featured":false}
